# 03. rajpurohitpooja/Salary_Prediction_Portfolio

## Exploratory Data Analysis | Series 2 - test_features.csv

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('03_test_features.csv')

In [3]:
# First 5 rows of the dataset
df.head()

,jobId,companyId,jobType,degree,major,industry,yearsExperience,milesFromMetropolis
0,JOB1362685407687,COMP33,MANAGER,HIGH_SCHOOL,NONE,HEALTH,22,73
1,JOB1362685407688,COMP13,JUNIOR,NONE,NONE,AUTO,20,47
2,JOB1362685407689,COMP10,CTO,MASTERS,BIOLOGY,HEALTH,17,9
3,JOB1362685407690,COMP21,MANAGER,HIGH_SCHOOL,NONE,OIL,14,96
4,JOB1362685407691,COMP36,JUNIOR,DOCTORAL,BIOLOGY,OIL,10,44

In [4]:
# All columns, their counts and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 8 columns):
 #   Column               Non-Null Count    Dtype
---  ------               --------------    -----
 0   jobId                1000000 non-null  object
 1   companyId            1000000 non-null  object
 2   jobType              1000000 non-null  object
 3   degree               1000000 non-null  object
 4   major                1000000 non-null  object
 5   industry             1000000 non-null  object
 6   yearsExperience      1000000 non-null  int64
 7   milesFromMetropolis  1000000 non-null  int64
dtypes: int64(2), object(6)
memory usage: 61.0+ MB

As expected, there is no `salary` column in this dataset.

In [5]:
print("There are {} different company IDs".format(df['companyId'].nunique()))
print("\n#### 10 MOST FREQUENT COMPANY IDS ####")
print(df['companyId'].value_counts().head(10))
print("\n#### 10 LEAST FREQUENT COMPANY IDS ####")
print(df['companyId'].value_counts(ascending=True).head(10))

There are 63 different company IDs

#### 10 MOST FREQUENT COMPANY IDS ####
COMP13    16130
COMP41    16127
COMP54    16098
COMP56    16058
COMP61    16035
COMP23    16026
COMP62    16024
COMP11    16010
COMP60    16005
COMP39    16004
Name: companyId, dtype: int64

#### 10 LEAST FREQUENT COMPANY IDS ####
COMP17    15595
COMP15    15611
COMP14    15638
COMP37    15644
COMP28    15670
COMP6     15684
COMP25    15698
COMP38    15707
COMP24    15717
COMP59    15720
Name: companyId, dtype: int64

In [6]:
print("There are {} different job types".format(df['jobType'].nunique()))
print("\n#### COUNTS OF JOB TYPES ####")
print(df['jobType'].value_counts())

There are 8 different job types

#### COUNTS OF JOB TYPES ####
VICE_PRESIDENT    125434
JANITOR           125253
SENIOR            125202
CFO               125092
JUNIOR            125022
CEO               124941
CTO               124665
MANAGER           124391
Name: jobType, dtype: int64

In [7]:
print("There are {} different degrees".format(df['degree'].nunique()))
print("\n#### COUNTS OF DEGREES ####")
print(df['degree'].value_counts())

There are 5 different degrees

#### COUNTS OF DEGREES ####
HIGH_SCHOOL    238255
NONE           237467
MASTERS        175236
DOCTORAL       175105
BACHELORS      173937
Name: degree, dtype: int64

In [8]:
print("There are {} different majors".format(df['major'].nunique()))
print("\n#### COUNTS OF MAJORS ####")
print(df['major'].value_counts())

There are 9 different majors

#### COUNTS OF MAJORS ####
NONE           534068
BIOLOGY         58804
ENGINEERING     58496
COMPSCI         58385
PHYSICS         58248
CHEMISTRY       58159
LITERATURE      58062
BUSINESS        57961
MATH            57817
Name: major, dtype: int64

In [9]:
print("There are {} different industries".format(df['industry'].nunique()))
print("\n#### COUNTS OF INDUSTRIES ####")
print(df['industry'].value_counts())

There are 7 different industries

#### COUNTS OF INDUSTRIES ####
SERVICE      143161
FINANCE      143101
WEB          143012
HEALTH       142978
EDUCATION    142731
OIL          142535
AUTO         142482
Name: industry, dtype: int64

In [11]:
# Get statistical info about numerical columns (yearsExperience, milesFromMetropolis)
df.describe()

       yearsExperience  milesFromMetropolis
count   1000000.000000       1000000.000000
mean         12.002104            49.526414
std           7.213179            28.889713
min           0.000000             0.000000
25%           6.000000            25.000000
50%          12.000000            50.000000
75%          18.000000            75.000000
max          24.000000            99.000000